class Helper:
    @staticmethod
    def show_help():
        help_text = (
            "Добро пожаловать в мини-помощник программы!\n"
            "1. Вы можете использовать данную программу для работы с JDK.\n"
            "2. Для компиляции файлов .class используйте опцию компиляции.\n"
            "3. Для декомпиляции используйте опцию декомпиляции.\n"
            "4. Вы можете настроить путь к JDK через настройки.\n"
            "5. Выполняйте команды и скрипты через консоль.\n\n"
            "Для получения дополнительной информации, введите команду 'help' в консоли."
        )
        return help_text